{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You decided to help your colleague Mark this time but asked him to handle such tasks without you while you are on leave. Now, a few hours later, you find yourself discussing this situation with Monica and Bob. [Monica] crossed her arms and sighed, while [Bob] leaned against the wall, looking thoughtful. You mentioned that you decided to help Mark this time but asked him to handle such tasks without you while you're on leave. [Monica] shook her head, [Bob] raised an eyebrow. You stated that if it happens again, you'll remind Mark that you're on leave and he should respect your time off. [Monica] rubbed her temples, while [Bob] nodded slowly.",
    "role": "Alex",
    "location": "Home",
    "description": "[Monica]: 'I hope Mark understands that. But what if he doesn't respect your boundary?' [Bob]: 'Yeah, he might still reach out. What's your plan if it happens again?'",
    "options": [
      {
        "text": "I'll just have to handle it when it comes up again. Let's hope for the best.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 3,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You provided an abstract and unclear response, showing moderate emotional perception and self-regulation. However, your motivation and proactive planning could be improved."
      },
      {
        "text": "If it happens again, I'll reiterate that I'm on leave and he should respect my time off.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 4,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You leaned toward agreement with setting clear boundaries, showing high emotional perception and self-regulation. However, your empathy towards Mark's situation was lower."
      },
      {
        "text": "Honestly, if it happens again, I'll have to seriously reconsider how I handle these requests. Maybe I need to be more assertive.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 2,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 3
        },
        "analysis": "You leaned toward disagreement with a passive-aggressive undertone, showing good social skills and empathy. However, your self-regulation was lower."
      }
    ]
  }
}