{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. Your colleague, Mark, messages: 'Hey Alex, I really need your help with this urgent task. Can you help me out?' You decided to help Mark with the urgent task despite being on leave. You've now finished the task and informed Mark about it. Later, [Monica] and [Bob] hear about this and have some thoughts. [Monica] comments, 'I can't believe you agreed to work on your leave, Alex. Don't you think you need to set better boundaries?' while [Bob] adds, 'Yeah, you're always the one stepping in. What if they start expecting it all the time?' You responded by justifying your decision and maintaining that if it becomes a habit, you'll address it then. Now, [Monica] frowns and [Bob] crosses his arms, looking concerned. [Monica] says, 'Alex, it's not just about setting boundaries for yourself. It affects all of us when exceptions become the norm.' [Bob] nods in agreement, 'Yeah, maybe we're being taken advantage of collectively.' You acknowledged the collective impact and suggested a group discussion on handling these situations better. As you discuss the situation further with [Monica] and [Bob], [Monica] sighs, 'We need to be on the same page as a team.' [Bob] adds, 'It's about fairness and respect for everyone's time.' You responded by understanding their frustration and trying to find a balance that works for everyone.",
    "role": "Alex",
    "location": "Home",
    "description": "[Monica] leans back, 'So, are we going to set these guidelines and stick to them?' [Bob] looks at you expectantly, 'Yeah, we need a clear plan, Alex. What do you think?'",
    "options": [
      {
        "text": "Let's draft a plan together right now to ensure we're all on the same page.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 4,
          "Motivation": 2
        },
        "analysis": "You showed high emotional perception and empathy by suggesting an immediate collaborative effort and good social skills, but your motivation to enforce boundaries could be stronger."
      },
      {
        "text": "I'm on board with setting guidelines, but let's discuss this further when we're all back at the office.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You maintained good self-regulation by suggesting a more appropriate time for discussion and balanced empathy and motivation, but showed moderate emotional perception."
      },
      {
        "text": "I agree we need guidelines, but let's not rush. We can figure things out step by step.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 4
        },
        "analysis": "You emphasized the need for a calm, step-by-step approach and showed motivation to adapt, but your empathy was somewhat lacking."
      }
    ]
  }
}