{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You decided to help your colleague Mark this time but asked him to handle such tasks without you while you are on leave. Now, a few hours later, you find yourself discussing this situation with Monica and Bob.",
    "role": "Alex",
    "location": "Home",
    "description": "[Monica]: 'I can't believe Mark asked you to work during your leave. That's so inconsiderate.' [Bob]: 'Yeah, but sometimes work emergencies happen. How did you handle it, Alex?'",
    "options": [
      {
        "text": "I told Mark I’d help this time but asked him to handle such tasks without me in the future.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 3
        },
        "analysis": "You showed good emotional perception and social skills by addressing the situation clearly and setting boundaries, although your empathy and self-regulation could be slightly improved."
      },
      {
        "text": "I told him I'm on leave and he needs to respect that. It's not my job to be available 24/7.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You maintained strong self-regulation by setting clear boundaries, but your empathy and motivation towards the team’s urgent needs were lower."
      },
      {
        "text": "I said I’d take a look at it now, and he should send me the details.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 2,
          "Empathy": 4,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You showed high empathy and emotional perception by agreeing to help, but your self-regulation was low as you interrupted your time off."
      }
    ]
  }
}