{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You decided to inform Mark that you are on leave and he needs to respect that, highlighting that it is not your job to be available 24/7. A few hours later, you find yourself discussing this situation with Monica and Bob. After explaining that you believe Mark understood your need to set healthy boundaries, Monica expressed concerns about what would happen if Mark doesn't respect them next time, while Bob mentioned potential issues with team relationships. You reiterated the importance of sticking to your boundaries, believing that you can deal with future issues as they arise. Now, the conversation continues.",
    "role": "Alex",
    "location": "Home",
    "description": "[Monica]: 'I get sticking to your boundaries, but what if it happens again? How will you handle it?' [Bob]: 'And what about the team's perception? They might think you're not a team player.'",
    "options": [
      {
        "text": "Honestly, I’ll handle it on a case-by-case basis. It's tricky, but I think it’s essential to prioritize self-care.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 3,
          "Social Skill": 2,
          "Motivation": 3
        },
        "analysis": "You showed good emotion perception and self-regulation by handling situations as they come, but lower social skills and empathy might make team dynamics challenging."
      },
      {
        "text": "I understand the concerns, but I believe clear communication is key. If the team knows my stance, they will respect it.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 2
        },
        "analysis": "You demonstrated strong self-regulation and social skills by emphasizing the importance of communication, but motivation towards team needs could be improved."
      },
      {
        "text": "If it keeps happening, maybe I need to have a deeper discussion with Mark about respecting boundaries.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You maintained moderate emotional perception and self-regulation, but lower empathy and social skills might lead to future tension in team dynamics."
      }
    ]
  }
}