{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. Your colleague, Mark, messages: 'Hey Alex, I really need your help with this urgent task. Can you help me out?' You decided to help Mark with the urgent task despite being on leave. You've now finished the task and informed Mark about it. Later, [Monica] and [Bob] hear about this and have some thoughts. [Monica] comments, 'I can't believe you agreed to work on your leave, Alex. Don't you think you need to set better boundaries?' while [Bob] adds, 'Yeah, you're always the one stepping in. What if they start expecting it all the time?'. You explained your actions to Monica and Bob saying, 'I know, but sometimes exceptions have to be made. I just hope they don't take it for granted.' Now, they seem unconvinced. [Monica] raises an eyebrow and says, 'But where do you draw the line, Alex?' [Bob] nods in agreement, adding, 'Yeah, you can't always be the go-to person.' You responded with, 'I hear you, but I don't think it's that black and white. Sometimes we have to be flexible.' Now, they still look doubtful. [Monica] crosses her arms and says, 'Flexibility is one thing, being taken advantage of is another.' [Bob] sighs, 'Well, you know how things are at the office. Are you sure this is the right approach?' You answered confidently, 'I understand your concerns, but I'm confident in my decision. If it becomes a problem, I'll address it then.'",
    "role": "Alex",
    "location": "Home",
    "description": "[Monica] shakes her head and responds, 'I just hope you're prepared for the fallout.' [Bob] shrugs, 'Yeah, it might not be easy to change things later.'",
    "options": [
      {
        "text": "I get it, but I believe in handling issues as they arise.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You maintained good self-regulation and showed empathy, but your motivation to proactively set boundaries could be improved."
      },
      {
        "text": "We'll cross that bridge when we get there. Let's not worry too much now.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 2,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 3
        },
        "analysis": "You showed good emotional perception and social skills by deferring the concern, but your self-regulation might need improvement."
      },
      {
        "text": "I appreciate your concern, but I think it's manageable. If it becomes too much, I'll handle it.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 4
        },
        "analysis": "You justified your decision and maintained good self-regulation, but showed less empathy towards their concerns."
      }
    ]
  }
}