{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. Your colleague, Mark, messages: 'Hey Alex, I really need your help with this urgent task. Can you help me out?' You responded, 'Mark, I'm currently on leave. Can you ask someone else, or can it wait until I return?' Mark replies, 'I understand you're off, but there's really no one else who can handle this as well as you. It's quite critical.' You then said, 'I understand the urgency. I'll help this time, but please ensure there’s a backup plan for such situations in the future.' Mark, relieved, replies, 'Thanks, Alex. I really appreciate it.' Later, your colleagues [Monica] and [Bob] also get wind of the situation. [Monica] says, 'Alex, it's really nice of you to help out during your leave.' [Bob] adds, 'But isn't it a bit unfair that you're being pulled in during your time off?' You replied, 'It's frustrating, but sometimes you just have to step up when needed.' [Monica] nods, 'I get that, but it feels like people are taking advantage of your willingness to help.' [Bob] chimes in, 'Yeah, it's like there's no respect for your personal boundaries.' You then said, 'It's getting a bit much. Maybe I should discuss this with management.'",
    "role": "Alex",
    "location": "Home",
    "description": "[Monica] sighs, 'Maybe a formal policy could help.' [Bob] adds, 'Or we just need to be more vocal about our personal time.'",
    "options": [
      {
        "text": "True, but creating a policy might take too long. What if we just start by setting clearer boundaries ourselves?",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 3
        },
        "analysis": "You show good emotional perception and social skills by suggesting a proactive approach, but balancing empathy and self-regulation could be improved."
      },
      {
        "text": "I agree. Maybe we should bring it up in the next team meeting and see what everyone thinks.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You show good empathy by considering the team’s opinion, but could improve on self-regulation and being more proactive."
      },
      {
        "text": "Honestly, it might be better to just handle it individually. Policies can sometimes complicate things.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 2,
          "Social Skill": 2,
          "Motivation": 3
        },
        "analysis": "You show good self-regulation by preferring a simpler approach but display lower empathy and social skills by dismissing a collective solution."
      }
    ]
  }
}