{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You decided to help your colleague Mark this time but asked him to handle such tasks without you while you are on leave. Now, a few hours later, you find yourself discussing this situation with Monica and Bob. [Monica] crossed her arms and sighed, while [Bob] leaned against the wall, looking thoughtful.",
    "role": "Alex",
    "location": "Home",
    "description": "[Monica]: 'I still can't get over the fact that Mark asked you to work during your leave. It's really unfair.' [Bob]: 'Yeah, but these things happen. Alex, do you think you made the right call?'",
    "options": [
      {
        "text": "Maybe, but sometimes it's hard to predict how things will turn out.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You acknowledged the complexity of the situation, showing some self-regulation and social skill, but your empathy and emotional perception were moderate."
      },
      {
        "text": "I think it was necessary to help out this time, but it shouldn't be a habit.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 2,
          "Empathy": 4,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You showed high empathy and emotional perception by understanding the urgency, but your self-regulation was lower as it could lead to repeat expectations."
      },
      {
        "text": "Honestly, I feel like it's setting a bad precedent. It should've been managed without me.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You maintained strong self-regulation by identifying the potential negative impact, but your empathy and motivation towards the team's needs were lower."
      }
    ]
  }
}