{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. Your colleague, Mark, messages: 'Hey Alex, I really need your help with this urgent task. Can you help me out?' You decided to help Mark with the urgent task despite being on leave. You've now finished the task and informed Mark about it. Later, [Monica] and [Bob] hear about this and have some thoughts. [Monica] comments, 'I can't believe you agreed to work on your leave, Alex. Don't you think you need to set better boundaries?' while [Bob] adds, 'Yeah, you're always the one stepping in. What if they start expecting it all the time?' You responded, 'I get what you're saying, but I felt it was necessary this time. I'll be more careful in the future.' [Monica] nods thoughtfully and says, 'I understand, but it's important to take care of yourself too.' [Bob] shrugs, 'Well, it's done now. Let's just hope it doesn't become a trend.' You replied, 'If it becomes a problem, I'll address it then. For now, let's not worry too much.'",
    "role": "Alex",
    "location": "Home",
    "description": "[Monica] sighs, 'I just don't want you to get burned out, Alex.' [Bob] adds, 'Yeah, it's not fair for you to always be the go-to person for emergencies.'",
    "options": [
      {
        "text": "I hear you both. I'll make sure to take it easy and not always be the first to jump in.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You acknowledged their concerns and showed good self-regulation, but your motivation to proactively set boundaries could be higher."
      },
      {
        "text": "Thanks for your concern. I'll try to balance things better moving forward.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 2,
          "Empathy": 4,
          "Social Skill": 4,
          "Motivation": 3
        },
        "analysis": "You showed high empathy and social skills by expressing appreciation for their concern, but self-regulation could be improved as you didn't fully commit to setting boundaries."
      },
      {
        "text": "I get it, but sometimes it's just easier to handle things myself.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You chose to justify your actions, showing moderate self-regulation but lower empathy and emotional perception towards their concerns."
      }
    ]
  }
}