{
  "scenes": {
    "background": "The team has successfully completed an important project, and everyone is excited to organize a celebration. However, there are differing opinions on how to celebrate. Colleague Sam suggests going to a bar for a lively party, Emma prefers a formal dinner, and Ryan proposes an outdoor team-building activity. You propose to vote on each option and go with the majority's choice to ensure everyone feels included. The team agrees, and a vote is conducted. The result is a tie between the formal dinner and the outdoor team-building activity. Monica and Bob are looking at you expectantly. You decide to skip the celebration and focus on the next project. Monica frowns and Bob looks disappointed. Monica says, 'I think we deserve a break after all our hard work.' Bob adds, 'Yeah, we need to celebrate, not just jump into more work.' You decide on a formal dinner. Everyone agrees, but the atmosphere remains a bit tense.",
    "role": "Alex",
    "location": "Office Conference Room",
    "description": "Monica says, 'So, are we going to make reservations for the dinner, or is it just an idea?' Bob adds, 'Yeah, we need to solidify the plans if we're actually doing this.'",
    "options": [
      {
        "text": "Let's discuss the details. Any suggestions for the venue and date?",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 3,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "This response keeps the discussion open, showing moderate levels of emotional detection, self-regulation, empathy, and social skills. Motivation is average as it seeks input without strong direction."
      },
      {
        "text": "Sure, let's book a nice place. How about next Friday evening?",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 4,
          "Empathy": 2,
          "Social Skill": 4,
          "Motivation": 3
        },
        "analysis": "This option shows good emotional detection and self-regulation by making a decisive call. Social skills are demonstrated well, but empathy is lower as it does not seek further input."
      },
      {
        "text": "If we're going to do this, let’s make it memorable. But remember, the next project is right around the corner.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 2,
          "Motivation": 4
        },
        "analysis": "This response shows higher motivation to maintain focus on work but lower emotional detection and empathy. Social skills are also lower due to the passive-aggressive undertone."
      }
    ]
  }
}