{
  "scenes": {
    "background": "You told Monica you're really busy with the urgent task and asked her to wait until you're done. However, after a while, [Bob] messages you, 'Hey, I saw that you told Monica to wait. Is everything okay? Do you need any help?'",
    "role": "Bob",
    "location": "Messaging App",
    "description": "'Hey, I saw that you told Monica to wait. Is everything okay? Do you need any help?'",
    "options": [
      {
        "text": "Thanks for asking, Bob. I'm managing for now, but I'll let you know if I need help.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 4
        },
        "analysis": "You appreciate Bob's offer but choose to handle things on your own, showing good self-regulation and motivation. However, empathy might be lacking as Bob's offer to help is not fully acknowledged."
      },
      {
        "text": "Actually, it would be great if you could help Monica with some of the updates while I focus on the main task.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 2,
          "Motivation": 3
        },
        "analysis": "You delegate tasks to balance the workload, showing good emotional perception and empathy. However, interpersonal balance could be better as it might come off as passing the responsibility."
      },
      {
        "text": "I'm fine handling this, but thanks for checking in. Maybe check with Monica if she needs anything.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 3,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 2
        },
        "analysis": "You maintain control over the task and redirect Bob to assist Monica, showing good social skills and emotional balance. However, motivation and self-regulation might be higher."
      }
    ]
  }
}