{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to assist despite being on leave, showing good emotional control and motivation. However, this may impact your ability to recharge effectively. You decide to quickly take a look at the task and realize it requires more effort than initially thought. You commit to finishing the task, showing high motivation and self-regulation, but social skills and emotional perception could be improved. Now, [Monica] and [Bob] are discussing the progress of the task with you. You chose to keep the communication open, showing good social skills, but the emotional perception and empathy could be better. [Monica] and [Bob] start discussing the deadline and your commitment level.",
    "role": "Monica",
    "location": "Team Chat",
    "description": "[Monica] says, 'We really appreciate your help, but since you're on leave, are you sure you can manage this without burning out?'",
    "options": [
      {
        "text": "I'll do my best, but it would help if we could share the load.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You show good emotional control and a balanced approach by asking to share the workload, but motivation is lower."
      },
      {
        "text": "I'm managing fine, but I'll let you know if it becomes too much.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 4,
          "Motivation": 3
        },
        "analysis": "You keep the communication open and show good social skills, but empathy and emotional perception could be better."
      },
      {
        "text": "Honestly, it's a bit overwhelming. Can someone else take over?",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 2,
          "Motivation": 2
        },
        "analysis": "You show good emotional perception and empathy by acknowledging the effort involved, but motivation and social skills are lower."
      }
    ]
  }
}