{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You decided to help for a short time but emphasized that you would need to hand it off to someone else after that. You informed your colleagues [Monica] and [Bob] about your decision, and now you're in a video call with them discussing the situation. After suggesting to see how much can be done quickly, [Monica] looks a bit hesitant.",
    "role": "Bob",
    "location": "Video Call",
    "description": "[Bob] shifts in his chair and says, 'I appreciate your willingness to help, but this task is critical. Can you at least stay on until the critical part is done?'",
    "options": [
      {
        "text": "I understand the urgency, but I really need to switch off soon. Can we set a hard cut-off time?",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You acknowledge the urgency but set a boundary, showing good emotional perception and self-regulation."
      },
      {
        "text": "Fine, I'll stay on until the critical part is done, but then I'm logging off.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 4,
          "Empathy": 2,
          "Social Skill": 4,
          "Motivation": 3
        },
        "analysis": "You agreed to extend your support, showing self-regulation and social skills, but empathy and emotional perception could be improved."
      },
      {
        "text": "I really can't extend beyond what I initially agreed. We need to find someone else.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 2,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 2
        },
        "analysis": "You reiterated your initial stance, showing good social skills and empathy but lacking in self-regulation and motivation."
      }
    ]
  }
}