{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You decided to assist despite being on leave, showing good emotional control and motivation. However, this impacted your ability to recharge effectively. You quickly took a look at the task and realized it required more effort than initially thought. When asked to stay on it longer, you prioritized your time off and declined, indicating that someone else would need to take over. [Monica] and [Bob] discuss the situation after your decision. You stood firm on your decision, showing good emotional perception and self-regulation, but social skills could be improved.",
    "role": "Monica",
    "location": "Office Chat",
    "description": "[Monica] turns to you and says, 'I get that you need your break, but Bob and I have been shouldering a lot of the workload lately. Can you at least offer some guidance on how we can proceed?'",
    "options": [
      {
        "text": "I'm really sorry, but I can't provide detailed guidance right now. Can you check the project documentation?",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 4,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You prioritize your time off while suggesting an alternative, showing good emotional perception and self-regulation, but empathy and motivation are lower."
      },
      {
        "text": "Alright, I can provide some brief guidance, but it will have to be quick.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 2,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 3
        },
        "analysis": "You offer to help briefly, showing good social skills and a balanced approach, but emotional control is lower."
      },
      {
        "text": "I understand your situation, but I need to disconnect completely to be effective when I return. We need to respect these boundaries.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 2,
          "Motivation": 3
        },
        "analysis": "You stand firm on your decision, emphasizing the importance of boundaries, showing good emotional perception and self-regulation, but social skills could be improved."
      }
    ]
  }
}