{
  "scenes": {
    "background": "You are leading a project team that has just received an urgent assignment requiring a significant amount of work to be completed within a tight deadline. The team is feeling a lot of pressure, and morale is low, with some members showing signs of frustration and anxiety.",
    "role": "Team Leader",
    "location": "Office",
    "description": "One of your team members, Sarah, says, 'I don't think we can make it in time. This is too much!'",
    "options": [
      {
        "text": "I know it's tough, but let's break it down into smaller tasks and tackle them one by one. We'll get through this together.",
        "scores": {
          "Emotion Perception": 4,
          "Emotion Regulation": 3,
          "Interpersonal Balance": 4,
          "Communication Skills": 3,
          "Social Skills": 3
        },
        "analysis": "You acknowledged the pressure and proposed a practical solution, showing good emotional perception and interpersonal balance."
      },
      {
        "text": "We’ve faced challenges before and succeeded. I believe in our team's ability to overcome this one as well. Let's stay focused and support each other.",
        "scores": {
          "Emotion Perception": 3,
          "Emotion Regulation": 4,
          "Interpersonal Balance": 3,
          "Communication Skills": 4,
          "Social Skills": 2
        },
        "analysis": "You motivated the team by reminding them of past successes, demonstrating good emotional regulation and communication skills."
      },
      {
        "text": "I understand it seems overwhelming, but we need to stay positive and keep pushing forward. If anyone is feeling particularly stressed, please let me know so we can find ways to help.",
        "scores": {
          "Emotion Perception": 4,
          "Emotion Regulation": 2,
          "Interpersonal Balance": 3,
          "Communication Skills": 3,
          "Social Skills": 4
        },
        "analysis": "You showed empathy and offered support, highlighting strong emotional perception and social skills."
      }
    ]
  }
}