{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to prioritize your time off and asked your colleague to reach out to another person. Later, you meet with [Monica] and [Bob] at a team gathering. [Monica] glances at you with a concerned expression, 'Hey [Alex], I heard you didn't help with the urgent task while you were on leave. [Bob] had to stay late to cover for you. What happened?' You acknowledged the situation and showed willingness to improve, promising to be available next time. [Bob] sighs and folds his arms, 'I get it, but it really put me in a tough spot. How do we ensure this doesn't happen again?' You suggested having a backup plan for such scenarios.",
    "role": "[Alex]",
    "location": "Team Gathering",
    "description": "[Monica] looks thoughtful and leans forward, 'A backup plan sounds good, but what if it's another emergency and no one else is available?'",
    "options": [
      {
        "text": "We could rotate on-call duties even during leaves.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You propose a practical solution that shows good emotional perception and empathy, balancing the team's needs and individual time off."
      },
      {
        "text": "I guess emergencies will always be tricky. We should just try our best.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 2,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You acknowledge the challenge but provide a less concrete solution, showing moderate emotional perception and empathy."
      },
      {
        "text": "Well, if it's really that urgent, maybe we should hire more backup staff.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 2,
          "Motivation": 3
        },
        "analysis": "You suggest a more drastic measure, indicating less empathy and social skill, but showing some motivation to solve the problem."
      }
    ]
  }
}