{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to take a quick look and help out. After some time, [Monica] and [Bob] approach you in the cafeteria. [Monica] looks slightly concerned while [Bob] seems indifferent. You expressed understanding of Monica's concerns and acknowledged you should have set clearer boundaries. [Bob] chimed in, suggesting that it's over the top to worry about boundaries and everyone needs to pitch in when things get tough. You responded by expressing concern for personal boundaries, indicating that pitching in all the time could leave no personal life.",
    "role": "[Alex]",
    "location": "Cafeteria",
    "description": "[Monica] frowns slightly and says, 'But [Alex], if we don't step up when needed, the whole team might suffer. How do you propose we handle such situations without compromising our well-being?'",
    "options": [
      {
        "text": "It's a tricky balance, Monica. Maybe we need to have a team meeting to discuss boundaries and expectations.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 2
        },
        "analysis": "You propose a solution that involves the team, showing good self-regulation and social skills while acknowledging the complexity of the issue."
      },
      {
        "text": "I suppose you're right. Sometimes we just have to put the team's needs first, even if it means personal sacrifices.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 2,
          "Motivation": 3
        },
        "analysis": "You lean towards agreement, showing empathy and emotional perception but lower social skills."
      },
      {
        "text": "If we constantly sacrifice our well-being, we’ll burn out. Maybe it's time to reassess our priorities as a team.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 2,
          "Motivation": 4
        },
        "analysis": "You express concern about burnout, showing strong motivation but lower empathy and social skills."
      }
    ]
  }
}