{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to take a quick look and help out. After some time, [Monica] and [Bob] approach you in the cafeteria. [Monica] looks slightly concerned while [Bob] seems indifferent.",
    "role": "[Alex]",
    "location": "Cafeteria",
    "description": "[Monica] says, 'Hey [Alex], I heard you helped out with the urgent task during your leave. That's really commendable, but don't you think it's setting a precedent for others to bother you on your days off?'",
    "options": [
      {
        "text": "I just wanted to make sure the team didn't struggle. It's a one-time thing, not a habit.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 3
        },
        "analysis": "You acknowledge the concern while expressing a balanced view, showing good self-regulation and social skills."
      },
      {
        "text": "I understand your point, Monica. Maybe I should have set clearer boundaries.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 2,
          "Motivation": 2
        },
        "analysis": "You agree with the concern, showing empathy and emotional perception but lower social skills and motivation."
      },
      {
        "text": "If helping out means setting a precedent, then maybe the team needs to be more self-reliant.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 2,
          "Motivation": 4
        },
        "analysis": "You take a more assertive stance, showing strong motivation but lower empathy and social skills."
      }
    ]
  }
}