{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to take a quick look and help out. After some time, [Monica] and [Bob] approach you in the cafeteria. [Monica] looks slightly concerned while [Bob] seems indifferent. You expressed understanding of Monica's concerns and acknowledged you should have set clearer boundaries. [Bob] then chimed in, and you emphasized the need for balance. [Monica] sighed and mentioned her frustration about people not respecting time off. You suggested discussing the matter with the team to set ground rules.",
    "role": "[Alex]",
    "location": "Cafeteria",
    "description": "[Bob] raises an eyebrow and says, 'Rules are fine, but what about when there's really no one else to do the task? Are we supposed to let things fall apart?'",
    "options": [
      {
        "text": "It's not ideal, but sometimes we have to make tough choices.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You acknowledge the dilemma and emphasize the need for making difficult decisions, showing good self-regulation and empathy."
      },
      {
        "text": "Maybe we should have a backup plan in place for such situations.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 4,
          "Motivation": 2
        },
        "analysis": "You suggest a proactive solution, demonstrating strong emotional perception and social skills while considering the team's needs."
      },
      {
        "text": "If we always jump in, the team won't learn to handle crises on their own.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 2,
          "Motivation": 4
        },
        "analysis": "You take a more assertive stance, emphasizing the importance of team self-reliance, showing strong motivation but lower empathy and social skills."
      }
    ]
  }
}