{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to take a quick look and help out. After some time, [Monica] and [Bob] approach you in the cafeteria. [Monica] looks slightly concerned while [Bob] seems indifferent. You explained that it was a one-time thing to make sure the team didn't struggle.",
    "role": "[Alex]",
    "location": "Cafeteria",
    "description": "[Monica] frowns slightly, 'I get that, [Alex], but what if this becomes a regular expectation? It's not fair to you.'",
    "options": [
      {
        "text": "I believe in supporting the team when needed, but I’ll make sure to set boundaries in the future.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You show empathy and willingness to help, maintaining good emotional perception and social skills while balancing personal time."
      },
      {
        "text": "I see your point, Monica. Maybe I should've communicated my limits better.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You offer assistance while setting boundaries, showing good self-regulation but moderate motivation."
      },
      {
        "text": "Honestly, if I'm needed this often, maybe the team needs to learn to cope without me.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 5,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You prioritize your time off, showing strong self-regulation but lower empathy and motivation."
      }
    ]
  }
}