{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to prioritize your time off and asked your colleague to reach out to another person. Later, you meet with [Monica] and [Bob] at a team gathering. [Monica] glances at you with a concerned expression, 'Hey [Alex], I heard you didn't help with the urgent task while you were on leave. [Bob] had to stay late to cover for you. What happened?' You acknowledged the situation and showed willingness to improve, promising to be available next time. [Bob] sighs and folds his arms, 'I get it, but it really put me in a tough spot. How do we ensure this doesn't happen again?' You implied that others should be able to handle tasks too, showing less empathy and social skills.",
    "role": "[Alex]",
    "location": "Team Gathering",
    "description": "[Monica] frowns slightly, 'It's just that we really needed your expertise, and it felt like you left us hanging. Can we count on you next time?'",
    "options": [
      {
        "text": "I hear you. Let's come up with a plan to avoid this in the future.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 4,
          "Motivation": 3
        },
        "analysis": "You show understanding and propose a solution, demonstrating good emotional perception, empathy, and social skills while maintaining balance."
      },
      {
        "text": "It's not like I took a vacation just to inconvenience you. I'll try to be more available next time.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 2,
          "Motivation": 3
        },
        "analysis": "You acknowledge the situation but with a passive-aggressive tone, showing less empathy and social skills."
      },
      {
        "text": "I understand it was tough. Let's ensure better communication next time.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 3,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You acknowledge the situation and suggest clear communication, showing moderate emotional perception, empathy, and social skills."
      }
    ]
  }
}