{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to take a quick look and help out. After some time, [Monica] and [Bob] approach you in the cafeteria. [Monica] looks slightly concerned while [Bob] seems indifferent. You explained that it was a one-time thing to make sure the team didn't struggle. [Monica] then expressed concern about setting a precedent. You agreed with her point and mentioned that perhaps you should have communicated your limits better. [Bob] smirks and says, 'Well, [Alex], if you keep helping out like that, you might as well never take a leave. Don’t you think it just shows how indispensable you are?' You responded assertively, suggesting that maybe the team needs to step up their game.",
    "role": "[Alex]",
    "location": "Cafeteria",
    "description": "[Monica] sighs, '[Alex], do you really think it's that simple? Sometimes it's not about stepping up but about the team knowing you'll always be there to back them up.'",
    "options": [
      {
        "text": "I get that, Monica, but there has to be a balance. I can't always be the fallback.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You acknowledge the concern while emphasizing the need for balance. This shows good emotional perception and empathy, but a moderate level of motivation."
      },
      {
        "text": "You’re right, but maybe we need to discuss this as a team to find a better solution.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 2,
          "Motivation": 2
        },
        "analysis": "You agree with the concern and propose a team discussion, showing strong empathy and emotional perception but lower social skills and motivation."
      },
      {
        "text": "If the team can't handle things without me, maybe we need to rethink our processes.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 5,
          "Empathy": 2,
          "Social Skill": 2,
          "Motivation": 3
        },
        "analysis": "You take a more critical stance, showing strong self-regulation but lower empathy and social skills."
      }
    ]
  }
}