{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to prioritize your time off and asked your colleague to reach out to another person. Later, you meet with [Monica] and [Bob] at a team gathering. [Monica] glances at you with a concerned expression, 'Hey [Alex], I heard you didn't help with the urgent task while you were on leave. [Bob] had to stay late to cover for you. What happened?' You suggest a constructive approach, saying, 'It was a tough call. Maybe we should discuss better ways to handle such situations in the future.' [Bob] nods slightly, but he still looks a bit annoyed. [Bob] crosses his arms and raises an eyebrow, 'Discussing is fine, but it doesn't change the fact that someone has to do the work. Why couldn't you just take a quick look?' You reply, showing empathy and willingness to improve, 'I get it, maybe I should've managed my time better. Let's find a way to balance this in the future.' [Monica] sighs and looks at [Bob], then back at you.",
    "role": "[Alex]",
    "location": "Team Gathering",
    "description": "[Monica] tilts her head slightly, 'So, what should we do if this happens again? Do you think we need a backup plan?'",
    "options": [
      {
        "text": "Let's create a roster so that if someone is on leave, there's always a designated backup.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 4,
          "Motivation": 4
        },
        "analysis": "You propose a proactive solution, showing good emotional perception, empathy, and social skills while maintaining motivation."
      },
      {
        "text": "Maybe we should just all agree to check in occasionally even when on leave.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You suggest a middle-ground approach, showing good self-regulation but slightly lower motivation."
      },
      {
        "text": "Honestly, if I'm on leave, I expect to fully disconnect. We should respect that boundary.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 5,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You emphasize the need for boundaries, showing strong self-regulation but lower empathy and emotional perception."
      }
    ]
  }
}