{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to take a quick look and help out. After some time, [Monica] and [Bob] approach you in the cafeteria. [Monica] looks slightly concerned while [Bob] seems indifferent. [Monica] says, 'Hey [Alex], I heard you helped out with the urgent task during your leave. That's really commendable, but don't you think it's setting a precedent for others to bother you on your days off?' You responded assertively, stating that maybe the team needs to be more self-reliant. [Bob] remarked that saying no to extra work might leave the team in a bind during real emergencies. You agreed with this point. Now, [Monica] looks at you with a concerned expression and asks what should be done in the future. You suggested discussing it in the next team meeting. [Monica] nods slightly, but [Bob] still seems skeptical.",
    "role": "[Alex]",
    "location": "Cafeteria",
    "description": "[Bob] folds his arms and says, 'But how do we ensure that everyone participates equally? Some people might not take it seriously.'",
    "options": [
      {
        "text": "It's about trust and accountability. We need to trust that everyone will do their part.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 2,
          "Motivation": 3
        },
        "analysis": "You emphasize the importance of trust and accountability, showing good emotional perception and empathy, but slightly lower social skills as it may be idealistic."
      },
      {
        "text": "We can set clear expectations and consequences for not participating.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 2
        },
        "analysis": "You suggest a structured approach, maintaining good self-regulation and social skills while showing moderate motivation."
      },
      {
        "text": "If some people don't take it seriously, maybe they shouldn't be part of the team.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 3,
          "Motivation": 4
        },
        "analysis": "You propose a more stringent solution, showing strong motivation but lower empathy and emotional perception."
      }
    ]
  }
}