{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to take a quick look and help out. After some time, [Monica] and [Bob] approach you in the cafeteria. [Monica] looks slightly concerned while [Bob] seems indifferent. You expressed understanding of Monica's concerns and acknowledged you should have set clearer boundaries. [Bob] chimed in, suggesting that it's over the top to worry about boundaries and everyone needs to pitch in when things get tough. You responded by expressing concern for personal boundaries, indicating that pitching in all the time could leave no personal life. [Monica] frowned slightly and mentioned that if the team doesn't step up when needed, the whole team might suffer. You leaned towards agreement, indicating that sometimes we have to put the team's needs first, even if it means personal sacrifices. [Bob] looks thoughtful, while [Monica] seems more relaxed.",
    "role": "[Alex]",
    "location": "Cafeteria",
    "description": "[Bob] says, 'Okay, [Alex], if we’re all going to make sacrifices, how do we ensure everyone is on the same page and no one feels taken advantage of?'",
    "options": [
      {
        "text": "We could implement a rotation system to share the load evenly.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 2
        },
        "analysis": "You suggest a practical solution that could help maintain balance, showing good self-regulation and social skills."
      },
      {
        "text": "Maybe you're right, Bob. We need to communicate more openly about our capacities.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 2,
          "Motivation": 3
        },
        "analysis": "You agree with the need for better communication, showing empathy and emotional perception but lower social skills."
      },
      {
        "text": "If we all keep sacrificing, we might end up resenting each other. It's important to set clear boundaries.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 2,
          "Motivation": 4
        },
        "analysis": "You emphasize the importance of boundaries, showing strong motivation but lower empathy and social skills."
      }
    ]
  }
}