{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to prioritize your time off and asked your colleague to reach out to another person. Later, you meet with [Monica] and [Bob] at a team gathering. [Monica] glances at you with a concerned expression, 'Hey [Alex], I heard you didn't help with the urgent task while you were on leave. [Bob] had to stay late to cover for you. What happened?' You responded by saying it was fair to ask someone else to handle it since you were on leave. [Bob] then sighs and says, 'I understand you're on leave, but couldn't you have at least checked in to see if it was really urgent? It put a lot of pressure on us.' You acknowledged this and said you should have checked in briefly to assess the situation. The conversation continues.",
    "role": "[Alex]",
    "location": "Team Gathering",
    "description": "[Monica] crosses her arms and adds, 'It's not just about this one time, [Alex]. We need to know we can count on each other, even when it's inconvenient.'",
    "options": [
      {
        "text": "I understand the importance. I'll be more mindful in the future.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You show empathy and a willingness to improve, demonstrating good emotional perception and social skills."
      },
      {
        "text": "I get it, but there are boundaries that need to be respected too.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You acknowledge the concern but also emphasize the need for boundaries, showing good self-regulation and emotional perception."
      },
      {
        "text": "I think we might need to revisit our emergency protocols so this doesn’t happen again.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 3,
          "Empathy": 3,
          "Social Skill": 4,
          "Motivation": 3
        },
        "analysis": "You suggest a constructive solution for future emergencies, showing good social skills and balanced emotional perception."
      }
    ]
  }
}