{
  "scenes": {
    "background": "You are on annual leave, enjoying some well-deserved time off to recharge. However, during your time away, a colleague messages you privately, saying there’s an urgent task that needs immediate attention. The request creates a dilemma as you try to balance respecting your time off while feeling the pressure to help with the urgent task. You chose to take a quick look and help out. After some time, [Monica] and [Bob] approach you in the cafeteria. [Monica] looks slightly concerned while [Bob] seems indifferent. You expressed understanding of Monica's concerns and acknowledged you should have set clearer boundaries. Bob commented that worrying about setting boundaries is over the top, and you agreed with him, noting that sometimes sacrifices are necessary for the team. Monica sighed and questioned how to avoid burnout, to which you suggested having a team discussion to set ground rules. [Bob] raises an eyebrow, looking a bit skeptical.",
    "role": "[Alex]",
    "location": "Cafeteria",
    "description": "[Bob] shrugs, 'Team discussions are fine, but let's be real, not everyone will agree. What if some team members don’t want to follow these ground rules?'",
    "options": [
      {
        "text": "It's inevitable that not everyone will agree, but we can at least try to reach a consensus and respect each other's needs.",
        "scores": {
          "Emotion Perception": 4,
          "Self Regulation": 3,
          "Empathy": 4,
          "Social Skill": 3,
          "Motivation": 2
        },
        "analysis": "You acknowledge the challenge and emphasize the importance of mutual respect, showing good emotional perception and empathy but moderate motivation."
      },
      {
        "text": "We can't force everyone to follow the rules, but we can set expectations and hold each other accountable.",
        "scores": {
          "Emotion Perception": 3,
          "Self Regulation": 4,
          "Empathy": 3,
          "Social Skill": 3,
          "Motivation": 3
        },
        "analysis": "You focus on setting expectations and accountability, demonstrating balanced emotional control and social skills."
      },
      {
        "text": "If some team members can't commit to the agreed rules, maybe they aren't suited for this team environment.",
        "scores": {
          "Emotion Perception": 2,
          "Self Regulation": 3,
          "Empathy": 2,
          "Social Skill": 2,
          "Motivation": 4
        },
        "analysis": "You take a more assertive stance, showing strong motivation but lower empathy and social skills."
      }
    ]
  }
}