{
  "scenes": {
    "background": "You are leading a project team that has just received an urgent assignment requiring a significant amount of work to be completed within a tight deadline. The team is feeling a lot of pressure, and morale is low, with some members showing signs of frustration and anxiety.\nEarlier, you acknowledged Lisa's feelings and suggested breaking down the tasks to manage them better. You also emphasized the importance of the project and asked for a team effort. Now, in the office, [Monica] and [Bob] are discussing with you. Bob looks particularly stressed and says, 'I don't see how we can get this done in time without working around the clock.' Monica chimes in, 'Yeah, and it's not fair to expect us to pull all-nighters.' After hearing your previous response, Bob says: 'I understand it's important, but this workload is really unreasonable. I don't think we can handle it without burning out.' Monica, visibly frustrated, adds, 'We need to come up with a realistic plan that doesn't exhaust us.'",
    "role": "Project Manager",
    "location": "Office",
    "description": "Bob, still looking stressed, says: 'We really need a strategy that works for everyone. What’s the plan?'",
    "options": [
      {
        "text": "Let's break down the tasks further and see if we can find a more efficient way to handle them.",
        "scores": {
          "Emotion Perception": 4,
          "Emotion Regulation": 3,
          "Interpersonal Balance": 4,
          "Communication Skills": 3,
          "Social Skills": 4
        },
        "analysis": "You suggested a detailed approach to manage the workload, demonstrating strong emotional perception and interpersonal balance skills."
      },
      {
        "text": "I understand, but we have to find a way to manage. If we all put in our best effort, we can achieve this.",
        "scores": {
          "Emotion Perception": 3,
          "Emotion Regulation": 4,
          "Interpersonal Balance": 3,
          "Communication Skills": 4,
          "Social Skills": 3
        },
        "analysis": "You acknowledged the difficulty but emphasized the need for effort, showing good emotional control and communication skills, though emotional detection could be improved."
      },
      {
        "text": "Complaining won't help us. We need to focus on actionable steps to get this done.",
        "scores": {
          "Emotion Perception": 2,
          "Emotion Regulation": 3,
          "Interpersonal Balance": 2,
          "Communication Skills": 3,
          "Social Skills": 2
        },
        "analysis": "You focused on the need for solutions but could have shown better emotional detection and interpersonal balance, as the response might come across as dismissive."
      }
    ]
  }
}